# 3) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 50-დან 200-მდე for loop-ის გამოყენებით.
# for i in range(50, 200):
#     print(i)

# 4) დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა ლუწ რიცხვს 1-დან 100-ის ჩათვლით for loop-ის გამოყენებით.
# for i in range(0,101,2):
#     print(i)

# 5) დაწერეთ პროგრამა, რომელიც გამოიტანს ყველა კენტ რიცხვს 100-დან 150-მდე for loop-ის გამოყენებით.
# for i in range(101, 150, 2):
#     print(i)

# 6) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 1-დან 50-ის ჩათვლით while loop-ის გამოყენებით.
# i = 0
# while i < 50:
#     i += 1
#     print(i)

# 7) დაწერეთ პროგრამა, რომელიც გამოიტანს რიცხვებს 20-დან 60-ის ჩათვლით, 5-ის გამოტოვებით while loop-ის გამოყენებით.

# i = 20
# while i < 60:
#     i += 5
#     print(i)