# 1) კომენტარის სახით ახსენით რას აკეთებს len(), append(), insert() და pop() ფუნქციები
#  len() - აბრუნებს ლისტში ან სტრინგში ელემენტების სიმბოლოების რაოდენობას.
#  append() - მითითებული სიის ბოლოს აბრუნებს გადაცემულ ელემენტს.
#  insert() - გადაეცემა 2 არგუმენტი: პირველი არგუმენტი ინდექსი, მეორე არგუმენტი ელემენტი.
# insert() - მოცემულ სიაში იმ ინდექსზე დაამატებს სასურველ ელემენტს.
#  pop() - მოცემული სიიდან ამოაგდემს კონკრეტულ ინდექსზე მყოფ ელემენტს.

# 2) შექმენით სია და შეინახეთ  5 სახელი. მომხმარებელს შემოატანინეთ სახელი და დაამატეთ ამ სიაში. ბოლოს, დაბეჭდეთ ამ სიის სიგრძე და სიის განახლებული ვერსია.
# name = ["name1","name2","name3","name4","name5"]

# Guest = input("Enter your name: ")
# name.append(Guest)
# print(name)

# 3) შექმენით სია: fruits = ["Melon", "Orange", "Cantaloupe", "Watermelon", "Kiwi"]
# ამოაგდეთ სიიდან ბოლო ელემენტი და მესამე ინდექსზე ჩასვით "Pomegranate".

# fruits = ["Melon", "Orange", "Cantaloupe", "Watermelon", "Kiwi"]
# fruits.pop(4)
# fruits.insert(3,"Pomegranate")
# print(fruits)