# 2) ახსენით თუ რისთვის არის საჭირო კარგი პრაქტიკების გამოყენება კოდის წერის დროს;
# როდესაც ჩვენ გვაქვს მიღებული კკარგი პრაქტიკა და ცოდნა მაშინ კოდის წერის დროს არ შეგვეშლება ბევრი რამ ადამიანს შეიძლება თეორიულად ჰქონდეს ნასწავლი მაგრამ პრაქტიკაში როგორ გამოიყენება მაგი არიცის 

# 3) შექმენით ორი ცვლადი და მათში შეინახეთ რიცხვები. შეასრულეთ ყველა ის მათემატიკური ოპერაცია, რაც აქამდე ვისწავლეთ და თითოეული ეს ოპერაცია შეინახეთ ცვლადებში. საბოლოოდ დაბეჭდეთ ამ ცვლადის მნიშვნელობები. რაც ყველაზე მთავარია - ამ დავალების შესრულებისას, თითოეულ ხაზზე კომენტარიებით უნდა ახსნათ თუ რა მოქმედებებს ასრულებთ.

num1 = 45      
num2 = 5
num = num1 + num2
print(num)

# პირველ რიგში შევქმენით num1 ცვლადი და მივანიჭეთ მნიშვნელობა 45 შემდეგ შევქმენი num2 ცვლადი და მივანიჭეთ მნიშვნელობა 5 შემდეგ შევქმენით num ცვლადი და მნიშვნელობა მივანიჭეთ პირველი ცვლადის და მეორე ცვლადის ჯამი ბოლოს კი დავპრინტეთ num ცვლადი რადგან მასში იყო მათემატიკური ოპერაცია ჩასმული

num1 = 45
num2 = 5
num = num1 - num2
print(num)

# პირველ რიგში შევქმენით num1 ცვლადი და მივანიჭეთ მნიშვნელობა 45 შემდეგ შევქმენი num2 ცვლადი და მივანიჭეთ მნიშვნელობა 5 შემდეგ შევქმენით num ცვლადი და მნიშვნელობა მივანიჭეთ პირველი ცვლადის და მეორე ცვლადის სხვაობა ბოლოს კი დავპრინტეთ num ცვლადი რადგან მასში იყო მათემატიკური ოპერაცია ჩასმული

num1 = 45
num2 = 5
num = num1 / num2
print(num)

# პირველ რიგში შევქმენით num1 ცვლადი და მივანიჭეთ მნიშვნელობა 45 შემდეგ შევქმენი num2 ცვლადი და მივანიჭეთ მნიშვნელობა 5 შემდეგ შევქმენით num ცვლადი და მნიშვნელობა მივანიჭეთ პირველი ცვლადის და მეორე ცვლადის გაყოფა ბოლოს კი დავპრინტეთ num ცვლადი რადგან მასში იყო მათემატიკური ოპერაცია ჩასმული

num1 = 45
num2 = 5
num = num1 * num2
print(num)

# პირველ რიგში შევქმენით num1 ცვლადი და მივანიჭეთ მნიშვნელობა 45 შემდეგ შევქმენი num2 ცვლადი და მივანიჭეთ მნიშვნელობა 5 შემდეგ შევქმენით num ცვლადი და მნიშვნელობა მივანიჭეთ პირველი ცვლადის და მეორე ცვლადის ნამრავლია ბოლოს კი დავპრინტეთ num ცვლადი რადგან მასში იყო მათემატიკური ოპერაცია ჩასმული

# გაასწორეთ მოცემული კოდები:

# 1. first_user = "Lika"
# 2nduser = "Giorgi"
# print(first user)


first_user = "lika"
second_user = " giorgi"
print(first_user + second_user)

# 2. first name = Data
# last % name = "random"

first_name = "data"
last_name = " luka"
print(first_name + last_name)

# 3. რას გამოიტანს ეს კოდი?
# Num1 = 20
# num2 = 30
# print(num1 + num2)
# შედეგი ახსენით კომენტარებით.

# შეცდომას რადგან Num1 ცვლადი პირველი დიდი ასოთი იწყება და პრინტში პატარა ასოთი გვაქვს დაწყებული კოდი იქნება შემდეგნაირად:
Num1 = 20
num2 = 30
print(Num1 + num2)
