# 2) კომენტარის სახით ჩამოწერეთ ყველა სტრინგის მეთოდი, რომელიც ისწავლეთ. თითოეულს მიუწერეთ დეტალური განმარტება და მათზე მოიყვანეთ თითო-თითო მაგალითი.
# string function 
# 1. .lower() - ს ვიყენებთ მაშინ როდესაც ჩვენ გვინდა სტრინგის ასოების დაპატარავება.
# 2. .upper() - ს ვიყენებთ მაშინ როდესაც ჩვენ გვინდა სტრინგის ასოების გადიდება.
# 3. .capitalize() - ს ვიყენებთ მაშინ როდესაც ჩვენ გვინდა სტრინგის პირველი ასო გავადიდოთ და დანარჩენი ასოები ავტომატურად დაპატარავდება.
# 4. .find() - ს საშუალებით ჩვენ ვგებულობს სტრინგის კონკრეტული ასო რომელ ინექსზე დგას და თუ არ გვაქვს ის ასო მაშინ ტერმინალში გამოიტანს -1 - ს.

# 2) მომხმარებელს შემოატანინეთ სიტყვა. ტერმინალში კი დაბეჭდეთ ეს სიტყვა ისე რომ იყოს:

# 1. ყველა პატარა ასო;
# print("HeLlo".lower())
# 2. ყველა დიდი ასო;
# print("HelLo".upper())
# 3. პირველი ასო დიდი, ხოლო ყველა დანარჩენი პატარა.
# print("hEllO".capitalize())

# 3) მომხმარებელს შემოატანინეთ სამი წინადადება და თითოეულზე გამოიყენეთ სხვადასხვა სტრინგის მეთოდი:

# პირველ წინადადებაზე — .lower()

# guest = input("Enter a sentence: ")
# print(guest.lower())

# მეორე წინადადებაზე — .upper()

# guest = input("Enter a sentence: ")
# print(guest.upper())

# მესამე წინადადებაზე — .capitalize()

# guest = input("Enter a sentence: ")
# print(guest.capitalize())

# 4) ცვლადში შეინახე შენი სახელი. მომხმარებელს შეეკითხე თავისი სახელი, იმ შემთხვევაში თუ თქვენი სახელები ემთხვევა დაბეჭდეთ "Our names are similar!", 
# თუ არ ემთხვევა დაბეჭდეთ "We have different names". გაითვალისწინეთ, რომ მომხმარებელმა შეიძლება თქვენნაირი სახელი შემოიტანოს,
# თუმცა სახელის ასოები შესაძლოა იყოს სხვადასხვა შრიფტის ზომით, ამიტომ ამან თქვენ პროგრამაში შეფერხება არ უნდა გამოიწვიოს (გამოიყენეთ ნასწავლი სტრინგის მეთოდები)

# name = "dachi"
# Guest = input("what is your name: ")

# if Guest.lower() == name:
#     print("Our names are similar!")
# else:
#     print("We have different names")

# 5) ცვლადში შეინახეთ წინადადება, დაწერეთ ისეთი პროგრამა რომ მხოლოდ წინადადების პირველი სიტყვა იყოს დიდი ასოთი, დანარჩენი კი იყოს პატარა.

# sentence = input("Enter a sentence: ")
# result = sentence.capitalize()
# print(result)

# 6) ცვლადში შეინახეთ რაიმე სტრინგი, შემდეგ .find() ფუნქციის მეშვეობით იპოვეთ რომელ ინდექსზეა კონკრეტული ასო.

# value = "dachi"
# print(value.find("i"))

# 7) შექმენით სია, სადაც დაამატებთ რანდენიმე სტრინგს. სიაში დამატებული თითოეული სტრინგი გადაიყვანეთ დიდ ასოებად for ციკლის მეშვეობით.

# სიებს ვერ გადავიყვანთ

# 8) ჩანაწერს გადახედეთ თავიდან.
