# 2) თქვენი სიტყვებით ახსენით თუ რატომ ვიყენებთ ფუნქციებს პითონში.
# ფუნქციებს იმისთვის ვიყენებთ პითონში რომ გარკვეული მოქმედებები კოდის განმეორება თავიდან ავიცილოთ ასევე კოდის ორგანიზებაში და წაკითხვის სიმარტივეში

# 4) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს მომხმარებლის სახელსა და ასაკს. ფუნქციამ უნდა დააბრუნოს მსგავსი წინადადება:
# "მომხმარებლის სახელი" არის "მომხმარებლის ასაკი" წლის.
# def name_age(name,age):
#     return f'{name}, არის {age} წლის.'
# print(name_age('დაჩი',16))

# 5) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს ერთ რიცხვს და საბოლოოდ პასუხად დააბრუნებს ამ რიცხვის კვადრატს. (რიცხვის ხარისხში აყვანის ოპერატორია **)
# def number(num):
#     return num * num
# num = 2
# print(number(num))

# 6) შექმენით ფუნქცია და გადაეცით ორი რიცხვი პარამეტრებად. ფუქნციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მეორე რიცხვის ხარისხში 
# def numbers(num1, num2):
#     return num1 ** num2

# num1 = 5
# num2 = 6
# print(numbers(num1,num2))

# 7) შექმენით ფუნქცია სახელწოდებით double_values რომელიც არგუმენტად მიიღებს სიას და დააბრუნებს ახალ სიას, სადაც თითოეული ელემენტი გაორმაგებული იქნება.

# def double_values(numbers):
#     double_list = []
#     for i in numbers:
#         double_list.append(i * 2)
#     return double_list

# numbers = [1,2,3,4,5,6,7,8,9,10]
# result = double_values(numbers)
# print(result)

# 8) შექმენით ფუნქცია და გადაეცით არგუმენტად სია. ფუნქციამ უნდა დააბრუნოს ახალი სია, რომლის თითოეული ელემენტიც უნდა იყოს კვადრატში აყვანილი.

# def number(list_numbers):
#     list1_numbers = []
#     for i in list_numbers:
#         list1_numbers.append(i * i)
#     return list1_numbers

# list_numbers = [1,2,3,4,5,6,7,8,9,]
# result = number(list_numbers)
# print(result)


# 9) შექმენით ფუნქცია სახელწოდებით sum, რომელსაც არგუმენტად გადაეცემა 3 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.

# def sum(num1,num2,num3):
#     return num1 + num2 + num3

# num1 = 1
# num2 = 2
# num3 = 3

# print(sum(num1,num2,num3))

# 10) შექმენით ფუნქცია სახელწოდებით substract, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების სხვაობა.

# def substract(num1,num2):
#     return num1 - num2

# num1 = 8
# num2 = 4

# print(substract(num1,num2))

# 11)  შექმენით ფუნქცია სახელწოდებით multiply, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების ნამრავლი.

# def multiply(num1, num2):
#     return num1 * num2

# num1 = 5
# num2 = 5

# print(multiply(num1, num2))

# 12) შექმენით ფუნქცია სახელწოდებით divide, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების განაყოფი.

# def divide(num1,num2):
#     return num1 // num2

# num1 = 10
# num2 = 2
# print(divide(num1,num2))

