# 1) ჩამოწერეთ ყველა შედარების ოპერატორი რომელიც ვისწავლეთ.
# მეტობა >
# ნაკლებობა <
# ტოლობა ==
# მეტია ან ტოლი >=
# ნაკლებია ან ტოლი <=
# არ უდრის !=


# 2) გააკეთეთ ყველა ნასწავლი ოპერატორის 2-2 მაგალითი

# age1 = 60
# age2 = 50
# print(age1 > age2)


# age1 = 60
# age2 = 50
# print(age2 <  age1)


# age1 = 60
# age2 = 60
# print(age1 == age2)


# age1 = 60
# age2 = 50
# print(age1 >= age2)


# age1 = 60
# age2 = 50
# print(age2 <= age1)


# age1 = 60
# age2 = 50
# print(age1 != age2)



# 3) დაწერეთ რას გამოიტანს ეს კოდი და ახსენით რატომ:

# num1 = "40"
# num2 = 40
# print(num1 == num2)

# error - ს სტრინგის და ინტეჯერით ვერანაირ მოქმედებას ვერ იზამ 

# 4)  დაწერეთ რას გამოიტანს ეს კოდი და ახსენით რატომ:

# soil_moisture = 80
# limit = 100
# print(soil_moisture != limit)

# ეს კოდი True არის ყველაფერი წესრიგშია
