# 2) ჩამოწერეთ პირობითი განცხადებების შემადგენელი ყველა Keyword-ი, თითოეულს თან დაურთეთ განმარტება და თქვენი სიტყვებით ახსენით თუ რატომ/რა შემთხვევებში არის elif keyword-ი საჭირო.
# if - საჭიროებს პირობას
# elif - საჭიროებს პრიობას
# else - არ საჭიროებს პირობას
# 3) ცვლადში შეინახეთ თქვენი ასაკი. შემდეგ მომხმარებელს შემოატანინეთ თავისი ასაკი. თუ თქვენი გვარები დაემთხვევა გამოიტანეთ "We are the same age", სხვა შემთხვევაში - "We are not the same age".
# age = int(input("enter your age: "))
# age1 = 16

# if age1 == age:
#     print("We are the same age")
# else:
#     print("We are not the same age")

# 4) დააკვირდით მოცემულ flowchart-ს, ახსენით მისი მუშაობის პრინციპი. მისი მიხედვით Vscode-ში დაწერეთ პროგრამა და აღწერეთ რა შედეგს გამოიტანს კოდი იმ შემთხვევაში, 
# როდესაც მომხმარებელი არის 14 წლის და არ არის სტუდენტი."We are not the same age"
# # მომხმარებლის მონაცემები
# age = int(input("enter your age: " ))
# is_student = False
# # ფასდაკლების ლოგიკა
# if age < 18:
#     if is_student:
#         print("20% discount")
#     else:
#         print("10% discount")
# else:
#     print("Regular price")

# HARD LVL
# --------

# 5) დაწერეთ პროგრამა, რომელიც მომხმარებლს მოსთხოვს, რომ შემოიტანოს დადებითი რიცხვი. 
# თუ მომხმარებელი შემოიტანს უარყოფით რიცხვს ან ნულს, პროგრამამ უნდა მოსთხოვოს რიცხვის თავიდან შემოტანა

# while True:
#     number = int(input("შეიყვანე დადებითი რიცხვი: "))
#     if number > 0:
#         print("თქვენ შემოიტანეთ დადებითი რიცხვი:")
#         break
#     else:
#         print(" შეიყვანეთ მხოლოდ დადებითი რიცხვი.")