# 4) თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში გვჭირდება ის, ასევე ასხენით თუ რა დანიშნულება აქვს კომენტარს Python-ში.
# ცვლადი არის ყუთი სადაც მნიშვნელობა ინახება მაგ: name = "dachi" ჩვენ შევქმენიც name ცვლადი და მას მნიშვნელობა მივანიჭეთ "dachi" 
# კომენტარი ჩვენ გვეხმარება რომ გავარკვიოთ სად რა კოდი გვიწერია დავუშვათ დავწერეთ კოდი მანდ კომენტარის სახით ჩვენ შეგვიძლია მოვნიშნოთ ეს კოდი თუ რაში დაგვეხმარება.

# 5) გაიხსენეთ ყველა ის მონაცემთა ტიპი, რომელიც ვისწავლეთ. თითოეული ამოწერეთ Python-ის ფაილში და print() ბრძანების საშუალებით დაბეჭდეთ თითოეული მონაცემთა ტიპის 5-5 მაგალითი (Boolean-ის შემთხვევაში მხოლოდ 2 მაგალითი).

# string
# name = "dachi"
# last_name = " alania"
# print(name + last_name)

# integer
# num1 = 6
# num2 = 9
# num3 = 2
# print(num1 * num2 / num3)

# float

# num1 = 6.9
# num2 = 9.5
# print(num1 * num2)


# bolean
# print(True and False or False and True and False or False and True and True)

