# 2) ახსენით თუ რას ეწოდება Control Flow.
# კომპიუტერის მიერ ინსტრუქციების შესრულებას. 

# 3) ჩამოწერეთ რამდენი კომპონენტისგან შედგება Control Flow და თითოეულს მიუწერეთ განმარტება.
# შედგება 3 ელემენტისაგან:
# sequences - კოდს მიყვება თანმიმდევრობით.
# iterations - იტერაცია კოდის განმეორება.
# selections - კოდში არჩევანის გაკეთება, გვიკონკრეტებს თუ რომელ გზას უნდა მივყვეთ.

# 4) თქვენი სიტყვებით ახსენით თუ რას ეწოდება Algorithm.
# არის ნაბიჯ ნაბიჯ ინსტრუქციების თანმიმდევრობა რომ შევასრულოთ დავალებები

# 5) მოიყვანეთ ალგორითმის 3 ნამდვილი ცხოვრების მაგალითი, 3-ც კი პროგრამირებიდან.
# რეცეპტის მომზადება 
# ბანკომატიდან ფულის გამოტანა 
# ტანსაცმლის გარეცხვა

# 6) ჩამოწერეთ რამდენი ტიპის ალგორითმი არსებობს და თითოეულს მიუწერეთ განმარტება.
# არსებობს 3 ტიპის ალგორითმი flow chart, pseudocode, natural language
# flow chart - როდესაც ალგორითმი გვაქვს მოცემული ნახაზი სახით
# pseudocode - არის გამარტივებული ენა რომელიც უფრო ახლოს არის პროგრამირების ენასთან
# natural language - ბუნებრივი ენით ახსნილი კოდი 


