# 2) თქვენი სიტყვებით ახსენით:
# • რას ეწოდება ფუნქცია?
# python ში ფუნქცია არის კოდის ბლოკი, რომელსაც კონკრეტული ამოცანის ამოხსნა შეუძლია, მაშინ, როცა მას გამოიძახებ
# • რისთვის გამოიყენება ფუნქციები Python-ში.
# python ში ფუნქციას გამოიყენება კოდის მრავალჯერ გამოყენებადობაში, ასევე რთული ამოცანების დაყოფაში, ასევე კოდის ორგანიზებაში.

# 3) კომენტარის სახით დაწერეთ, რას ეწოდება არგუმენტი. როგორც გაკვეთილზე ავხსენით ნახაზის საშუალებით - ასევე თქვენც გევალებათ, რომ Paint-ში ახსნათ ფუნქციის სინტაქსი და მისი არგუმენტები.
# ფუნქციის არგუმენტს აქვს ორი გზა არ გადავცემთ არგუმენტს და გადავცემთ არგუმენტს, არგუმენტს როდესაც არ გადავცემთ მანდაც ორი გზაა პროგრამა რომელიც გამოიტანს ერორს და პროგრამა რომელიც არ გამოიტანს ერორს
# 4) შექმენით ისეთი სია, სადაც შეინახავთ ყველა ნასწავლ მონაცემთა ტიპს ორ-ორჯერ, რომლებსაც მოათავსებთ სხვადასხვა ინდექსებზე. ბოლოს ინდექსინგის საშუალებით გამოიტანეთ მხოლოდ Boolean მნიშვნელობები.


# -- for loop --

# value = [1,2.5,"string",True,25,"blabla",False,25.5]
# boolean = []
# for i in value:
#     if type(i) == bool:
#         boolean = boolean + [i]
#     print(boolean)
# 5) შექმენთი სია [2, 4, 6, 8, 10].
# გადაუარეთ for ციკლით და სიის ელემენტების გაორმაგებული მნიშვნელობები ეკრანზე დაბეჭდეთ.
# numbers = [2, 4, 6, 8, 10]
# for i in numbers:
#     print(i * 2)

# 6) იპოვეთ და დაბეჭდეთ 1-დან 100-მდე რიცხვების თანმიმდებრობიდან მხოლოდ ის რიცხვები, რომლებიც იყოფა 5-ზე.

# -- while loop --


# num = 1
# while num <= 100:
#     if num % 5 == 0:
#         print(num)
#     num += 1
# 7) დაწერეთ პროგრამა, სადაც მომხმარებელს შემოატანინებთ რიცხვებს მანამ, სანამ ის არ შეიყვანს 0-ს. ბოლოს დაბეჭდეთ ყველა მცდელობაზე შემოტანილი რიცხვების ჯამი.



# total = 0
# while True:
#     Guest_numbers = int(input("Enter numbers: "))
#     if Guest_numbers == 0:
#         break
    
#     total += Guest_numbers
# print(total)

# 8) while loop-ის გამოყენებით იპოვეთ და დაბეჭდეთ 1-დან 30-მდე მხოლოდ ლუწი რიცხვები.

# -- Indexing & Slicing --

num = 1
while num <= 30:
    if num % 2 == 0:
        print(num)

# 9) დაწერეთ პროგრამა, სადაც მომხმარებელს აარჩევინებთ ნებისმიერ სტრინგს, შემდეგ კი მოცემული სტრინგიდან მხოლოდ კენტ ინდექსზე მდგომ ელემენტებს გამოიტანს ტერმინალში.

# -- Conditional Statements --

# 10) დაწერეთ პროგრამა, რომელიც შეადარებს მომხმარენლის მიერ შემოტანილ ორ რიცხვს და დაბეჭდავს, რომელი უფრო მეტია ან ტოლია.

# 11) მომხმარებელს შემოატანინეთ ასაკი. გამოიყენეთ პირობითი განცხადებები რომ შექმნათ პროგრამა, სადაც - იმ შემთხვევაში თუ User იქნება 13 წელზე ნაკლენბი ასაკის გამოიტანთ 'You are a child'. თუ იქნება 13 წელზე მეტი, მაგრამ 18-ზე ნაკლები ასაკის დაუბეჭდეთ 'You are a teen'. თუ 18 წელზე მეტის იქნება დაუბეჭდეთ 'You are an adult.'