
# 1) შექმენით items ცვლადი, რომელშიც შინახავთ მინიმუმ 10 ტექნიკას (მაგ. კომპიუტერი, მიკროფონი, ა.შ). გამოიტანეთ Items სიიდან ყოველი მეოთხე ელემენტი Slicing-ის გამოყენებით.
items = ["computer", "phone", "TV", "keyboard", "mouse","mikrophone,","Motherboard","Optical Drive","GPU","RAM"]
social_items = items[::4]
print(social_items)
# 2) ცვლადში შეინახეთ თქვენი სახელი და გვარი, ჯერ დაბეჭდეთ ტავდაპირველი ვერსია, შემდეგ კი შებრუნებული.
full_name = "dachi alania"
print(full_name[:])
print(full_name[::-1])

# 3) შექმენით Fruits ცვლადი და შეინახეთ მასში მინიმუმ 7ც ხილი. შეაბრუნეთ Fruits სია, შემდეგ Slicing-ის გამოყენებით გამოიტანეთ სიის ბოლო 3 ელემენტი.
fruits = ["apple","banana","orange","strawberry","cherry","pear","peach"]
fruits1 = fruits[4:]
print(fruits1)

# 4) რას ეწოდება Slicing? ახსენით დეტალურად კომენტარებით. ამასთანავე ახსენით Slicing-ის სინტაქსი (პლიუს start, stop, step როგორ მუშაობს)
# slicing არის როდესაც სტრინგიდან ან ლისტიდან ამოვჭრით რაღაც ნაწილს
# როგორც for ციკლში გვაქვს ისე არის slicing შიც (1:9:3) 1 არის საიდანაც დაიწყებს 9 არის სადაც დაასრულებს და 3 არის რამდენით გადახდება ანუ დაიწყებს 1 დან და გადახდება 3ით 
# ყოველ ჯერზე და მივა ცხრამდე

# 5) მოიყვანეთ მაგალითი თუ რატომ არის სტრინგი შუცვლელიმონაცემის ტიპი და თუ რატომაა სია შეცვლადი.
academy = "Goi"
academy[2] = "a"
print(academy)
# ეს კოდი error იქნება იმიტომ რომ სტრინგს ჩვენ ვერ შევუცვლით ვერანაირ ასოს მხოლოდ ლისტებს