# 2) დაწერეთ პროგრამა, სადაც თავდაპირველად მომხმარებელს შემოატანინებთ ანგარიშის პაროლს, შემდეგ შეეკითხეთ რომ გაიმეოროს იქამდე, სანამ არ დაემთხვევა შეყვანილი პაროლი.

password = input("შეიყვანეთ თქვენი პაროლი: ")

repeat = input("გაიმეორეთ თქვენი პაროლი: ")
while repeat != password:
    print("არ ემთხვევა პაროლი სცადეთ ხელახლა")
    repeat = input("გაიმეორეთ პაროლი: ")
print("პაროლი წარმატებით დამტკიცდა")

# 3) შექმენით Number guess game:

# ცვლადში შეინახეთ სასურველი რიცხვი. მომხმარებელს Input-ის მეშვეობით შეეკითხეთ ეცადოს რიცხვის გამოცნობა, ვერ გამოცნობის შემთხვევა გამოუტანეთ 
# "Try again" და იქამდე გამოუტანეთ Input ველი სანამ არ გამოიცნობს რიცხვს. წარმატებით გამოცნობის შემთხვევაში გამოუტანეთ "You guessed the number sucessfully!".
guest = int(input("გამოიცანით რიცხვი: "))
number = 10

while guest != number:
    print("არასწორია პასუხი")
    guest = int(input("ხელახლა სცადეთ"))
print("გამოიცანი რიცხვიი!!!")

# 4) შექმენით სია, სადაც შეინახავთ თქვენს საყვარელ ცხოველებს. გამოიტანეთ სიიდან პირველი და ბოლო ელემენტი და ერთ ხაზზე დაბეჭდეთ.

animals = ["dogs","lion","wolf"]
print(animals[0], animals[2])

# 5) შექმენით სია და მასში შეინახეთ თქვენი საყვარელი ფერები (მინიმუმ 5). გამოიყენეთ უარყოფითი ინდექსინგი (Negative Indexing) იმისთვის, რომ გამოიტანოთ სიის მესამე ელემენტი.
paints = ["black","blue","white","orange","green"]
print(paints[-3])

# ----------
# HARD LEVEL:

# შექმენით სახელების სია და მასში დაამატეთ 3 სახელი, თუმცა სამივე სახელი უნდა იყოს მომხმარებლის მიერ შემოტანილი. დაბეჭდეთ სიის მნიშვნელობა.
names = []

name1 = input("შეოყვანეთ თქვენი სახელი: ")
name2 = input("შეიყვანეთ თქვენი მეორე სახელი: ")
name3 = input("შეიყვანეთ თქვენი მესამე სახელი: ")

names.append(name1)
names.append(name2)
names.append(name3)

print(names)
