# 2) მომხმარებელს შემოატანინეთ გვარი. გამოიყენეთ For loop-ი იმისთვის, რომ მისი გვარის თითოეული ასო ცალცალკე გამოიტანოთ ტერმინალში.
# surname = input("enter your surname: ")
# for i in surname:
#     print(i)

# 3) დაწერეთ წვენის გაყიდვის პროგრამა სუპერმარკეტისთვის:
# stock = 300  # საწყისი მარაგი

# while stock >= 2:
#     print("You have bought the drink.")
#     stock -= 2
#     print("დარჩენილი მარაგი:")

# print("Out of stock")


# ჩათვალეთ წვენების საწყისი რაოდენობა არის 300. თითოეული მომხმარებელი მარკეტში შემოსვლისას ყიდულობს 2 წვენს. პროგრამამ უნდა გამოიტანოს "You have bought the drink" და გვერდზე მარაგში დარჩენილი წვენების რაოდენობა. როდესა მარაგი ამოიწურება - ტერმინალში დაობეჭდოს "Out of stock"

# 4) დაწერეთ For loop-ის პროგრამა, რომელიც 50-დან 20-მდე გამოიტანს რიცხვებს 3-3 რიცხვის გამოკლებით.
# for i in range(50,19, -3):
#     print(i)

# 5) დაწერეთ While loop_ის პროგრამა, რომელიც 150-დან 0-მდე გამოიტანს ყველა რიცხვს.
# number = 150
# while number > 0:
#     number -= 1
#     print(number)

# 6) თქვენი სიტყვებით დაწვრილებით ახსენით, თუ როგორ მუშაობს While loop.
# while loop მუშაობს მანამ სანამ პირობა მართალია მაგალითა:
# count = 0
# while count < 5:
#     print(count)
#     count += 1
